Revit 2027 API
PolymeshFacet.GetVertices Method
 Returns the three vertices that define this facet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetVertices()
Public Function GetVertices As IList(Of Integer)
public:
IList<int>^ GetVertices()
member GetVertices : unit -> IList<int>
Return Value
IList<Int32>
Remarks
 A container with three integers (indices of the vertices) is returned.
See Also
Reference
PolymeshFacet Class
Autodesk.Revit.DB Namespace